# 2) დეტალურად აღწერეთ თუ რა განსხვავებაა ბრჭყალებში ჩაწერილ რიცხვსა და ჩვეულებრივ ინტეჯერ რიცხვს შორის.

#ბრჭყალებში იწერება როდესაც რიცხვი სტინგია და ჩვეულებრივ ინტეჯერ რიცხვს არ სჭირდება ბრჭყალები


# 3) ექმენით ორი ცვლადი და თითოეულში შეინახეთ რიცხვები. შექმენით ოთხი ცვლადი: 
# • Addition
# • Substraction
# • Multiplication
# • Division
# და მოცემულ შესაბამის ცვლადებში შეინახეთ რიცხვებს შორის განხორციელებული მათემატიკური ოპერაციები.

num1 = 44
num2 = 123

addition = num1 + num2
substraction = num1 - num2
multipication = num1 * num2
division = num1 / num2

# 4) შექმენით ორი ცვლადი a = 57, b = 4 და დაბეჭდეთ:
# • ჯამი
# • სხვაობა
# • ნამრავლი
# • გაყოფის შედეგი
# • მთელრიცხვიანი გაყოფა
# • ნაშთი
# • ხარისხი (a ხარისხად b)

a=57
b=4

print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a % b)
print(a ** b)

# 5) გადაიტანეთ მოცემული კოდი Vscode-ში. დაბეჭდეთ x ცვლადი და ახსენით რატომ გამოიტანა x ცვლადმა მსგავსი შედეგი.
# x = 10
# x = x + 5
# x = x * 2

x = 10
x = x + 5
x = x * 2

print(x)

#თავდაპირველად x = 10 შემდეგ ვანახლებთ x ს მნიშვნელობას და x = 10+5 და შემდეგ ისევ ვანახლებთ x ის მნიშვნელობას და x = 15 * 2 da  და x = 30

# 6) შექმენით ცვლადი balance = 100
# შემდეგ:
# • მოაკელით 30
# • დაამატეთ 50
# • გააორმაგეთ იგი
# ყოველ ეტაპზე განახლებული მნიშვნელობა ისევ balance ცვლადში შეინახეთ.
# ბოლოს დაბეჭდეთ საბოლოო ბალანსი.

balance=100

balance = balance - 30
balance = balance + 50
balance = balance * 2
print(balance)

# 7) ტერმინალში გამოიტანეთ 'Group 96 is the best' 96-ჯერ.

num1 = "group 96 is the best"

print(num1 * 96)
