# 1) კომენტარის სახით ახსენით ყველა მათემატიკური ოპერატორი და მოიყვანეთ თითოეულ ოპერატორზე ერთი მაგალითი და დაპრინტეთ 

print( 3 + 4)   #ამატებს რიცხვებს
print(12 - 4)   #აკლებს რიცხვებს
print(3 * 3)    #ამრავლებს რიცხვებს
print(25 / 5)   #ყოფს რიცხვებს
print(123 % 5)  #გამოაქვს ნაშთი რიცხვიდან
print(2 ** 4)   #ახარისხებს რიცხვებს
print(45 // 3)  #ყოფს და ამრგვალებს

# 2) კომენტარის სახით ახსენით რა არის კონკატინაცია, მოიყვანეთ ორი მაგალითი და დაპრინტეთ

#კონკატინაცია არის სტრინგების შეერთება 
print("name " + "age")

# 3) შექმენი ცვლადები num1 , num2 შეინახეთ integer ტიპის მნიშვნელობები და დაპრინტეთ მათი ჯამი 

num1 = 12
num2 = 21

print( num1 + num2)
# 4) შექმენი ცვლადები name , age , height შეინახეთ შესაბამისი მნიშვნელობები და f string-ის გამოყენებით დაბეჭდეთ წინადადება 
# "Hello <name>, my age is <age> and my height is <height>"

name = "soso"
age = 15
height = 1.72

print(f"hello {name} my age is {age} and my height is {height}")


