# 2) Web-ში დასერჩეთ ინფორმაცია Python-ის შესახებ.  ყველაზე მნიშვნელოვანი მასალა ამოიწერეთ Level 01-ის Homework ფაილში და გამოიტანეთ print()-ის საშუალებით.

# 3) კომენტარის სახით ახსენით, თუ რას აკეთებს print() ბრძანება Python-ში.

# 4) შექმენით 2 ცვლადი: ორივე Integer ტიპის. პირველ ცვლადში შეინახეთ თქვენი ასაკი, მეორე ცვლადში კი თქვენი მეგობრის. ორივე გამოიტანეთ ცალ-ცალკე ხაზებზე.

# 5) შექმენით 3 ცვლადი. სამივე ცვლადში String ტიპის მონაცემი შეინახეთ. შემდეგ print() - ში სცადეთ რომ სამივე ცვლადის სახელი ერთმანეთთან შეართოთ + ოპერატორის საშუალებით. დააკვირდით შედეგს.

# 6) აუცილებლად ყველამ გადახედეთ გაკვეთილის მეორე ნახევარს ხელმეორედ.

# 7) დაიმატეთ ყველა ჯგუფის წევრი მეგობრებში და დაახლოვდით :)



print("Python არის მაღალი დონის პროგრამირების ენა, რომელიც შექმნილია მარტივად სწავლასა და გამოყენებაზე ორიენტირებით. მისი სინტაქსი მკაფიო და გასაგებია, რაც დამწყებთათვის განსაკუთრებით მოსახერხებელს ხდის.")
print("Python ფართოდ გამოიყენება სხვადასხვა სფეროში, როგორიცაა ვებ-დეველოპმენტი, მონაცემთა ანალიზი, ხელოვნური ინტელექტი, მანქანური სწავლება და პროგრამების ავტომატიზაცია. ამ ენას გააჩნია მრავალი მზა ბიბლიოთეკა და ფრეიმვორკი, რომლებიც ამარტივებს პროგრამების შექმნას.")
print("Python მუშაობს სხვადასხვა ოპერაციულ სისტემაზე, მათ შორის Windows, macOS და Linux. მისი პოპულარობა მუდმივად იზრდება, რადგან ის ძლიერია, მოქნილი და ეფექტური პროგრამირების ინსტრუმენტი.")

# პრინტ ბრძანება გვაძლევს საშუალებას რომ ეკრანზე გამოვიტანოთ ჩვენს მიერ ჩაწერილი კოდი

#integer

num = 15
print(num)

age = 16
print(age)


#string

name = "soso"

lastname = "chekurishvili"

age = "15"

print("hello my name is "+ name + " and my  last name is " + lastname + " and i am " + age + " years old")  

